{"stoi": {"\u0007": 0, "\t": 1, " ": 2, "#": 3, "$": 4, "%": 5, "&": 6, "'": 7, "(": 8, ")": 9, "*": 10, "+": 11, ",": 12, "-": 13, ".": 14, "/": 15, "0": 16, "1": 17, "2": 18, "3": 19, "4": 20, "5": 21, "6": 22, "7": 23, "8": 24, "9": 25, ":": 26, ";": 27, "<": 28, "=": 29, ">": 30, "?": 31, "@": 32, "A": 33, "B": 34, "C": 35, "D": 36, "E": 37, "F": 38, "G": 39, "H": 40, "I": 41, "J": 42, "K": 43, "L": 44, "M": 45, "N": 46, "O": 47, "P": 48, "Q": 49, "R": 50, "S": 51, "T": 52, "U": 53, "V": 54, "W": 55, "X": 56, "Y": 57, "Z": 58, "[": 59, "]": 60, "_": 61, "a": 62, "b": 63, "c": 64, "d": 65, "e": 66, "f": 67, "g": 68, "h": 69, "i": 70, "j": 71, "k": 72, "l": 73, "m": 74, "n": 75, "o": 76, "p": 77, "q": 78, "r": 79, "s": 80, "t": 81, "u": 82, "v": 83, "w": 84, "x": 85, "y": 86, "z": 87, "{": 88, "}": 89, "~": 90, "\u00a0": 91, "\u00a3": 92, "\u00a9": 93, "\u00ab": 94, "\u00ae": 95, "\u00bb": 96, "\u00da": 97, "\u00e3": 98, "\u00e4": 99, "\u00e5": 100, "\u00e7": 101, "\u00f8": 102, "\u2002": 103, "\u2013": 104, "\u2014": 105, "\u2018": 106, "\u2019": 107, "\u201c": 108, "\u201d": 109, "\u2020": 110, "\u2021": 111, "\u2022": 112, "\u2192": 113, "\u2212": 114, "\u25a0": 115, "\ufb01": 116, "\ufeff": 117}, "itos": {"0": "\u0007", "1": "\t", "2": " ", "3": "#", "4": "$", "5": "%", "6": "&", "7": "'", "8": "(", "9": ")", "10": "*", "11": "+", "12": ",", "13": "-", "14": ".", "15": "/", "16": "0", "17": "1", "18": "2", "19": "3", "20": "4", "21": "5", "22": "6", "23": "7", "24": "8", "25": "9", "26": ":", "27": ";", "28": "<", "29": "=", "30": ">", "31": "?", "32": "@", "33": "A", "34": "B", "35": "C", "36": "D", "37": "E", "38": "F", "39": "G", "40": "H", "41": "I", "42": "J", "43": "K", "44": "L", "45": "M", "46": "N", "47": "O", "48": "P", "49": "Q", "50": "R", "51": "S", "52": "T", "53": "U", "54": "V", "55": "W", "56": "X", "57": "Y", "58": "Z", "59": "[", "60": "]", "61": "_", "62": "a", "63": "b", "64": "c", "65": "d", "66": "e", "67": "f", "68": "g", "69": "h", "70": "i", "71": "j", "72": "k", "73": "l", "74": "m", "75": "n", "76": "o", "77": "p", "78": "q", "79": "r", "80": "s", "81": "t", "82": "u", "83": "v", "84": "w", "85": "x", "86": "y", "87": "z", "88": "{", "89": "}", "90": "~", "91": "\u00a0", "92": "\u00a3", "93": "\u00a9", "94": "\u00ab", "95": "\u00ae", "96": "\u00bb", "97": "\u00da", "98": "\u00e3", "99": "\u00e4", "100": "\u00e5", "101": "\u00e7", "102": "\u00f8", "103": "\u2002", "104": "\u2013", "105": "\u2014", "106": "\u2018", "107": "\u2019", "108": "\u201c", "109": "\u201d", "110": "\u2020", "111": "\u2021", "112": "\u2022", "113": "\u2192", "114": "\u2212", "115": "\u25a0", "116": "\ufb01", "117": "\ufeff"}}