{"time-consuming": 0, "slow-to-change": 1, "deadline,": 2, "crisis": 3, "Whittaker": 4, "\u201cAgile": 5, "redefining": 6, "rival": 7, "(CAD)": 8, "CIMs,": 9, "one-way.": 10, "layouts": 11, "Addison-Wesley,": 12, "<": 13, "transparently": 14, "broader": 15, "documentation.": 16, "(gas": 17, "nor-": 18, "landline": 19, "F.,": 20, "modeling": 21, "www.pearsonglobaleditions.com": 22, "safety.": 23, "12.2.3": 24, "468": 25, "\u201crare\u201d": 26, "120\u201321": 27, "\u201cimplementation": 28, "25.4": 29, "coordination.": 30, "resort.": 31, "deltas.": 32, "confidence.": 33, "maintenanceFigure": 34, "fraud": 35, "tempted": 36, "program\u2019s": 37, "357,": 38, "begin-": 39, "\u201clook": 40, "73\u201374,": 41, "reentered": 42, "Follow-up": 43, "Coding": 44, "HTTPS,": 45, "225": 46, "brainstorm": 47, "Complex-": 48, "18.3.": 49, "work": 50, "Anticipating": 51, "377,": 52, "following:": 53, "dents.": 54, "Controllers": 55, "People": 56, "24.3.1": 57, "(T.": 58, "213\u2013215": 59, "\u201csoft\u201d": 60, "scale)": 61, "Anomalous": 62, "Assigning": 63, "preconditions,": 64, "structural,": 65, "virtual": 66, "key-based": 67, "Mitchell,": 68, "introduced,": 69, "then-branch": 70, "Developer\u2019s": 71, "method)": 72, "Encrypting": 73, "sprintSprint": 74, "poor-quality": 75, "Symbol": 76, "380": 77, "information": 78, "engineering\u2014": 79, "made.": 80, "property.": 81, "263": 82, "15.13.": 83, "act.": 84, "opinion,": 85, "purchasing;": 86, "3-D": 87, "evaluation,": 88, "specialized,": 89, "(rules),": 90, "principle": 91, "evolved": 92, "question": 93, "inception,": 94, "92\u201393,": 95, "ethically": 96, "(fields": 97, "visited": 98, "Torres-Pomales": 99, "understandabil-": 100, "Model-Driven": 101, "independent,": 102, "situation;": 103, "75\u201376,": 104, "treated": 105, "(availability": 106, "easy;": 107, "(Humphrey,": 108, "Culture": 109, "mandated": 110, "cdIn": 111, "139": 112, "263\u201364": 113, "room": 114, "Full": 115, "149\u201350": 116, "weather\u2013send": 117, "Scaling": 118, "groundTemperatures": 119, "cre-": 120, "publishes": 121, "309": 122, "(mission-critical),": 123, "\u201calt\u201d": 124, "introductory": 125, "419\u201320": 126, "data-driven": 127, "soon": 128, "undesirable.": 129, "book.": 130, "Henry": 131, "instance.": 132, "reportStatus": 133, "(Jhala": 134, "12:": 135, "18.10": 136, "registration": 137, "20.1,": 138, "fed": 139, "simulating": 140, "usage.": 141, "Time": 142, "displaying": 143, "21.11,": 144, "notably:": 145, "most": 146, "http://www.jot.fm/issues/issue_2003_01/column6": 147, "Incomplete": 148, "pumped;": 149, "temperatures;": 150, "widely-used": 151, "equation)": 152, "freeze": 153, "(real-time),": 154, "respectively.": 155, "s3": 156, "Elephant:": 157, "portable": 158, "Damage": 159, "readers": 160, "2001.": 161, "ghosting": 162, "180": 163, "ambiguous": 164, "differing": 165, "phone.": 166, "binding": 167, "Firewalls": 168, "simulator": 169, "Scrum.": 170, "556": 171, "stages.": 172, "1..4": 173, "SOAP": 174, "interfaces": 175, "Technically,": 176, "key.": 177, "difference\u2014small": 178, "delta-based": 179, "burned": 180, "age-specific": 181, "month.": 182, "countries": 183, "develop": 184, "PUBLIC": 185, "mini-": 186, "Silva,": 187, "makers,": 188, "[-5]": 189, "purposes,": 190, "(report)": 191, "5000": 192, "composition.": 193, "values)": 194, "corrected.": 195, "2.1.3": 196, "(Schneier": 197, "students": 198, "patching": 199, "Like": 200, "discontinue": 201, "darker": 202, "r": 203, "Customer": 204, "applica-": 205, "Test-driven": 206, "test": 207, "overtime.": 208, "imply": 209, "v4v5": 210, "analysis;": 211, "confused": 212, "processed,": 213, "claims": 214, "been": 215, "10.2.1": 216, "technical,": 217, "media.": 218, "Kumar,": 219, "(QoS),": 220, "jargon,": 221, "MDA": 222, "accelerated": 223, "Open": 224, "technologies,": 225, "sprint.": 226, "Owner": 227, "main-": 228, "irrespective": 229, "spending": 230, "399\u2013400": 231, "1990.": 232, "17.9": 233, "2007.": 234, "Communication": 235, "server-based": 236, "24.12": 237, "compar-": 238, "FL.": 239, "752\u201353": 240, "streams.": 241, "age.": 242, "439": 243, "kits": 244, "621": 245, "(Various": 246, "constructed": 247, "X.": 248, "early-1980s": 249, "risky.": 250, "1998),": 251, "Faivre,": 252, "Week": 253, "occupied)": 254, "edges": 255, "heterogeneity,": 256, "Layered": 257, "features.": 258, "(6):": 259, "Putting": 260, "special,": 261, "491": 262, "Crabtree": 263, "known": 264, "invented": 265, "\u201chow.\u201d": 266, "incorrect,": 267, "cook.\u201d": 268, "Technology.": 269, "760": 270, "done,": 271, "assign": 272, "expressing": 273, "risky": 274, "company-specific": 275, "guarantee": 276, "accepts": 277, "separate,": 278, "assignment": 279, "Gagne.": 280, "version-controlled": 281, "catWhiteSpace": 282, "layers": 283, "Sreport": 284, "Architecture),": 285, "erately": 286, "709": 287, "perhaps,": 288, "weaknesses.": 289, "regu-": 290, "623": 291, "videos.": 292, "Hp": 293, "consumer/producer": 294, "assurance,": 295, "352\u201353": 296, "craft": 297, "Reliable": 298, "(Lau": 299, "inspector,": 300, "\u201cSocio-Technical": 301, "debugging\u2014the": 302, "native": 303, "ontology-based": 304, "tively": 305, "businesses": 306, "printers.": 307, "shippable,\u201d": 308, "cheap": 309, "Chrissis,": 310, "Dissatisfaction": 311, "13)": 312, "horses,": 313, "undesirable,": 314, "life-cycle": 315, "reductionist,": 316, "Bamford,": 317, "mapping": 318, "contact": 319, "contents": 320, "tions.": 321, "Businesses": 322, "PhotoLibrary.libSize()": 323, "1.17": 324, "self-organize": 325, "drones": 326, "99.9%": 327, "unfamiliar": 328, "handle": 329, "step": 330, "18.14.": 331, "mon": 332, "anywhere": 333, "(5).": 334, "snapshot": 335, "\u201cWhy": 336, "readable": 337, "437\u201363,": 338, "316\u201317": 339, "Dorset": 340, "administered.\u201d": 341, "Treatment": 342, "reassigned": 343, "(Viller": 344, "(notably": 345, "Java-specific,": 346, "enhancementFault": 347, "penetration": 348, "A-Team.\u201d": 349, "(Royce": 350, "389\u201392": 351, "13.4.1": 352, "500": 353, "Manager:": 354, "four-stage": 355, "formulate": 356, "Perhaps": 357, "Setting": 358, "Simplistically,": 359, "<operation": 360, "Scotland).": 361, "Uploaded": 362, "compound": 363, "multicore": 364, "spent": 365, "(May/June": 366, "Monk,": 367, "incidents.": 368, "complete.": 369, "Hose": 370, "detecting,": 371, "Interacting": 372, "pattern,": 373, "Entertainment,": 374, "PlaceAndDate,": 375, "procedures,": 376, "reusability.": 377, "origin": 378, "build\u201d;": 379, "10.2": 380, "Unstable.\u201d": 381, "Current": 382, "SimpleInterestCalculator": 383, "17.1.1.": 384, "tree.": 385, "login/password": 386, "manifest": 387, "software-controlled": 388, "employer,": 389, "displayed": 390, "(X).": 391, "Dependable": 392, "maintenance:": 393, "Profil-Verlag.": 394, "minimum,": 395, "deeply": 396, "viewpoint.": 397, "length": 398, "fire,": 399, "incomplete": 400, "Contract.\u201d": 401, "consume": 402, "graphical,": 403, "135,": 404, "running": 405, "ponent": 406, "correcting": 407, "illustrated": 408, "Subject": 409, "197,": 410, "university.": 411, "24)": 412, "Codelines": 413, "physicists": 414, "426": 415, "replaceable": 416, "notation.": 417, "Display": 418, "deliv-": 419, "oper.": 420, "ous": 421, "22.1.4": 422, "competitive": 423, "16.3": 424, "c6": 425, "ses,": 426, "enterprises,": 427, "rein-": 428, "tary": 429, "LLC,": 430, "Tokyo": 431, "height": 432, "3.0.": 433, "468,": 434, "(Bott": 435, "Dis-": 436, "430,": 437, "1973.": 438, "24.01.11": 439, "tured": 440, "tivized": 441, "proved\u201d": 442, "Client\u2013server": 443, "12.": 444, "Definition\u2014Concept": 445, "manage-": 446, "ever,": 447, "refined": 448, "Advanced": 449, "websites": 450, "error": 451, "Practical": 452, "WS-BPEL": 453, "216\u201318,": 454, "Bell,": 455, "lists,": 456, "McGraw.": 457, "three-channel": 458, "sections,": 459, "interruptions": 460, "emotional": 461, "making": 462, "NASA-SP": 463, "safely": 464, "procedures": 465, "prune": 466, "Informally,": 467, ".)": 468, "entity-based": 469, "Markkula,": 470, "Agility:": 471, "2013.": 472, "Requests": 473, "guaranteed.": 474, "600\u201302,": 475, "80,": 476, "Window": 477, "Six": 478, "Behavioral": 479, "currency.": 480, "ownership,": 481, "budgeting": 482, "worms.": 483, "interest": 484, "British": 485, "deploy": 486, "Validity": 487, "Normal": 488, "video:": 489, "mented": 490, "listen": 491, "370": 492, "figure,": 493, "employer": 494, "221": 495, "neutron": 496, "789": 497, "Dijkstra,": 498, "metric,": 499, "patterns:": 500, "unpopular.": 501, "mary": 502, "expected,": 503, "practitionerHospital": 504, "implementation,": 505, "requires.": 506, "competitor\u2019s.": 507, "high-level,": 508, "plausible": 509, "starts,": 510, "terminology.": 511, "(Scrum),": 512, "actual": 513, "facing": 514, "Early": 515, "249,": 516, "Optimizing": 517, "symbol": 518, "appropriate": 519, "Shimeall,": 520, "\u201ctime\u201d": 521, "6.15": 522, "c9": 523, "contributed": 524, "(1988).": 525, "Web-based": 526, "permanently": 527, "marks": 528, "accomplished": 529, "groups": 530, "teeth": 531, "one-to-one": 532, "Subsystems": 533, "559,": 534, "why": 535, "http://www.acm.org/about/se-code": 536, "(a)": 537, "process-driven": 538, "put": 539, "531\u201332": 540, "Event-driven": 541, "312\u201318": 542, "reaching": 543, "Principal": 544, "scenarios": 545, "complete;": 546, "21.9.": 547, "History.\u201d": 548, "506": 549, "365)": 550, "2.2.2": 551, "Software\u0007failures\u0007can\u0007cause\u0007considerable": 552, "proper": 553, "2006": 554, "Mismatch:": 555, "/>": 556, "http://www.allaboutagile.com/": 557, "approved,": 558, "redevelopment,": 559, "design": 560, "principled": 561, "nosis": 562, "\u201clanes.\u201d": 563, "inferences.": 564, "definitive": 565, "critically": 566, "Assurance.": 567, "box": 568, "r1)/4)": 569, "term.": 570, "partners.": 571, "identification": 572, "sig-": 573, "usu-": 574, "473": 575, "ignoring": 576, "consistent,": 577, "estimate": 578, "want": 579, "adopters": 580, "fall": 581, "fulfill": 582, "straints,": 583, "38\u201339,": 584, "2010),": 585, "(before": 586, "primitives": 587, "270\u201379,": 588, "future,": 589, "compromised,": 590, "Scacchi,": 591, "\u201cTurning": 592, "Fallacy:": 593, "components?": 594, "resentation;": 595, "performs": 596, "Stewart,": 597, "(CBSE)": 598, "robot,": 599, "educate": 600, "durations,": 601, "testing;": 602, "authenticated": 603, "architecting": 604, "last-minute": 605, "ties.": 606, "ified": 607, "c3,": 608, "reliably": 609, "avoidance": 610, "replicate": 611, "ASM": 612, "testable": 613, "711": 614, "compiled": 615, "Computing": 616, "designer": 617, "10,000": 618, "(G.": 619, "Transfer": 620, "meanings.": 621, "738\u201339": 622, "authority,": 623, "unsure": 624, "fries?": 625, "see": 626, "Critically,": 627, "(WS-BPEL)": 628, "corners": 629, "sub-components?": 630, "Hungary.": 631, "unprocessed": 632, "produces": 633, "14.3": 634, "half-power": 635, "614,": 636, "200\u201301": 637, "analog": 638, "copyright.": 639, "values\u0007for\u0007the\u0007reliability\u0007metrics.": 640, "encrypted.": 641, "computer.": 642, "clear.": 643, "video": 644, "Clinic": 645, "(Dijkstra": 646, "11.2.": 647, "Google,": 648, "mice,": 649, "Siau,": 650, "sensor": 651, "applicants": 652, "517": 653, "pays": 654, "disconnected": 655, "predicted": 656, "Education.": 657, "injected.": 658, "215,": 659, "Cambridge,": 660, "Value-driven": 661, "Good": 662, "Interpreter": 663, "Location": 664, "Multi-tenancy": 665, "21.19": 666, "progress,": 667, "enclosed": 668, "(Torres-Pomales": 669, "409,": 670, "tooling.": 671, "ersion": 672, "restricted": 673, "generators.": 674, "tremendously": 675, "middleware,": 676, "contains": 677, "2004)": 678, "pair": 679, "manager.": 680, "(Northrop": 681, "17.8.": 682, "(increments),": 683, "executing.": 684, "11.13).": 685, "11)": 686, "arises.": 687, "feels": 688, "resale": 689, "here.": 690, "19.10.": 691, "objective.": 692, "ization": 693, "loops": 694, "5.3": 695, "defeat": 696, "91,": 697, "Enemies": 698, "corporate": 699, "radioactivity": 700, "festo,": 701, "392\u201395": 702, "trades": 703, "optimistic": 704, "impressive,": 705, "Ashgate": 706, "imprecision": 707, "investment.": 708, "capabilities,": 709, "possi-": 710, "Warsaw": 711, "super-": 712, "24.5).": 713, "individually": 714, "cyber-resilience": 715, "\u0007users\u0007for\u0007losses\u0007that\u0007are\u0007": 716, "restarted": 717, "cryptographic": 718, "chapter;": 719, "dividing": 720, "alignment": 721, "dosage": 722, "updating": 723, "good": 724, "photograph": 725, "159\u201362": 726, "Profile": 727, "supply,": 728, "strategy,": 729, "Ultra-Large": 730, "prescriptive": 731, "protective": 732, "ough": 733, "layers:": 734, "DI": 735, "downtime).": 736, "self-fulfilling.": 737, "recalculated,": 738, "11.14": 739, "stage": 740, "242\u201345": 741, "Cohesiveness.\u201d": 742, "bindings,": 743, "Trees.\u201d": 744, "Circular": 745, "C1.1": 746, "occur;": 747, "MaxMinTemp": 748, "arising": 749, "easy": 750, "units,": 751, "cause.": 752, "arose": 753, "success-": 754, "cyberattacks,": 755, "regulated,": 756, "(D.": 757, "257,": 758, "studies": 759, "vendor": 760, "restored,": 761, "lower": 762, "607,": 763, "encryp-": 764, "achievement": 765, "Returns": 766, "language-specific": 767, "formance,": 768, "radation": 769, "93\u201396,": 770, "deterring,": 771, "prior": 772, "postCodeStripper.getPostCode": 773, "straightforward": 774, "backup;": 775, "star": 776, "If,": 777, "explosion,": 778, "three": 779, "operator/manager": 780, "259\u201360,": 781, "malfunc-": 782, "Backup": 783, "runs": 784, "rther": 785, "Internals": 786, "application,": 787, "users.": 788, "ing": 789, "readied": 790, "clashed": 791, "tical.": 792, "well.": 793, "commentary": 794, "meta-data": 795, "PRS.": 796, "regulator,": 797, "manages:": 798, "accidents": 799, "19.8": 800, "7.3.2": 801, "\u201cwsdlns:": 802, "Applying": 803, "desk-": 804, "debug-": 805, "(xUML),": 806, "summarize": 807, "diagram)": 808, "notion": 809, "732\u201333": 810, "broker,": 811, "mixes": 812, "read-": 813, "Nonpreemptive": 814, "Concepts,": 815, "captur-": 816, "characteristics)": 817, "suc-": 818, "maintenance/development,": 819, "sages,": 820, "compile-time": 821, "Export": 822, "consistency.": 823, "there-": 824, "standardized": 825, "clearly": 826, "deliverables.": 827, "362\u201363": 828, "inspection.": 829, "(2012)": 830, "accommo-": 831, "18.15": 832, "blogs": 833, "&": 834, "high-cost": 835, "updates": 836, "zone": 837, "reviews.": 838, "fa\u00e7ade": 839, "sensitivity": 840, "ance,": 841, "fail-secure": 842, "ethics,": 843, "meaning": 844, "5.3.3": 845, "egories": 846, "p.m),": 847, "film,": 848, "Brazendale,": 849, "(hence": 850, "translators,": 851, "text,": 852, "147": 853, "QM:": 854, "integration:": 855, "http://software-engineering-book.com/case-studies/": 856, "Now": 857, "Business,": 858, "approaches": 859, "improve": 860, "pipes": 861, "attack.": 862, "</xs:complexType>": 863, "clips.": 864, "(Krutchen": 865, "hormone": 866, "replicated": 867, "words,": 868, "our-": 869, "minimumDose": 870, "WS-Reliable": 871, "authorized).": 872, "ripple": 873, "system?Figure": 874, "problem": 875, "drawbacks": 876, "agree": 877, "by": 878, "arbitrary": 879, "fraction": 880, "compromise.": 881, "Guide.": 882, "attacked.": 883, "24\u201331.": 884, "ponents,": 885, "security-critical": 886, "http://software-engineering-book.com/web/domain-requirements/": 887, "Manual,": 888, "reused": 889, "Fagan,": 890, "direct-": 891, "327": 892, "integrity,": 893, "ence,": 894, "1996.": 895, "McCay,": 896, "trolled": 897, "head": 898, "declining": 899, "Group": 900, "tomized,": 901, "irrational": 902, "likely": 903, "all.": 904, "270": 905, "(Parnas,": 906, "thorough": 907, "Prentice": 908, "1988)": 909, "backup.": 910, "equivalent,": 911, "anticipate.": 912, "lost": 913, "simplifies": 914, "1-292-09613-6": 915, "derailing,": 916, "top-down": 917, "Client\u2013Server": 918, "Lidman.": 919, "terms": 920, "layer.": 921, "286": 922, "conformity": 923, "Enterprises": 924, "Flaws": 925, "settle": 926, "viewed": 927, "scratch": 928, "synchronous": 929, "Krutchen,": 930, "urement": 931, "den": 932, "Length": 933, "desirable": 934, "arrows": 935, "consequence": 936, "Client\u2013": 937, "recall,": 938, "closed,": 939, "sss98web.pdf": 940, "15\u201318.": 941, "further": 942, "577": 943, "VC": 944, "mal": 945, "Handbook": 946, "License.": 947, "Longitudinal": 948, "and": 949, "handlers,": 950, "prototyping,": 951, "docu": 952, "awkward": 953, "719": 954, "Finish": 955, "85\u201388,": 956, "EuroSys": 957, "ambiguous,": 958, "inefficiency.": 959, "downloaded.": 960, "saves": 961, "mySQL": 962, "383,": 963, "Timeout": 964, "idea": 965, "argue": 966, "October": 967, "knock-on": 968, "644": 969, "infrastructure\u2014energy,": 970, "\u201cRESTful": 971, "coverage;": 972, "90%": 973, "entation": 974, "1\u201313.": 975, "reconnect": 976, "\u201cArchitectural": 977, "agility.": 978, "base.": 979, "internal": 980, "detail),": 981, "unex-": 982, "terminates": 983, "Actors": 984, "Morisio": 985, "(Storey": 986, "Timestamp": 987, "owner.": 988, "manages": 989, "\u201cConstruction": 990, "4.18": 991, "19).": 992, "vary": 993, "Royce.": 994, "polit-": 995, "possi": 996, "consists": 997, "19.4": 998, "complexity).": 999, "$50": 1000, "Reading.)": 1001, "robust?": 1002, "perspective.": 1003, "closed\u201d": 1004, "585": 1005, "value\u2014it": 1006, "ble,": 1007, "illustration,": 1008, "edge": 1009, "face": 1010, "1.4": 1011, "Kemerer,": 1012, "95:": 1013, "low": 1014, "treat": 1015, "advertising": 1016, "software;": 1017, "moving.\u201d": 1018, "automation": 1019, "charts": 1020, "7.": 1021, "way.": 1022, "calculations": 1023, "616,": 1024, "611\u201312": 1025, "increas-": 1026, "interview.": 1027, "emphasizes": 1028, "Service.\u201d": 1029, "(e.g.": 1030, "Contractor": 1031, "instrumentation": 1032, "API": 1033, "80": 1034, "305,": 1035, "18.4)": 1036, "Secrets": 1037, "options": 1038, "peoples\u2019": 1039, "consult": 1040, "integration.": 1041, "slightly": 1042, "Waiting": 1043, "(Fagan,": 1044, "instruments.": 1045, "26);": 1046, "http://dx.doi.org/10.1145/": 1047, "graphic": 1048, "finally": 1049, "practi-": 1050, "maintained": 1051, "Zero": 1052, "dotted": 1053, "namespace:name": 1054, "Beijing,": 1055, "expertise)": 1056, "iteration.": 1057, "Email": 1058, "622": 1059, "not?": 1060, "Integrated": 1061, "impressed": 1062, "closed.": 1063, "Ethical,": 1064, "convince": 1065, "54": 1066, "configures": 1067, "complement": 1068, "undergo": 1069, "\u2020Lutz,": 1070, "VM": 1071, "(operation": 1072, "rich": 1073, "\u201csystems": 1074, "playing": 1075, "representations": 1076, "Maintainability.\u201d": 1077, "localize": 1078, "190,": 1079, "run.": 1080, "third": 1081, "width": 1082, "Proposal": 1083, "Duplicate": 1084, "spiral,": 1085, "compatibility": 1086, "http://dx.doi.org/10.1109/FOSE.2007.17.": 1087, "differs": 1088, "gaining": 1089, "\u0007in\u0007the\u0007same\u0007way\u0007that\u0007consumer": 1090, "legal": 1091, "L1": 1092, "threshold,": 1093, "53,": 1094, "downtime": 1095, "broadening": 1096, "authentication.": 1097, "duration": 1098, "156\u201358": 1099, "continuum.": 1100, "open\u201d": 1101, "30": 1102, "Human-Computer": 1103, "protection.": 1104, "milliseconds": 1105, "SCRAN": 1106, "\u00abinterface\u00bb": 1107, "217,": 1108, "geographically": 1109, "run,": 1110, "Eclipse,": 1111, "tenuous": 1112, "spiral": 1113, "processing,": 1114, "val-": 1115, "Brian": 1116, "Printed": 1117, "Candidate": 1118, "1987.": 1119, "complaints.": 1120, "19th": 1121, "mer": 1122, "built-in": 1123, "regulations).": 1124, "Two-tier": 1125, "unlocked": 1126, "373": 1127, "(MDE)": 1128, "King": 1129, "11.2": 1130, "position,": 1131, "months.": 1132, "absorb": 1133, "SatComms:request": 1134, "practitioner": 1135, "other's": 1136, "tives": 1137, "4-part": 1138, "Media": 1139, "norm.": 1140, "attrib-": 1141, "proved.": 1142, "550": 1143, "messages,": 1144, "enjoyment.": 1145, "tester.": 1146, "landscape": 1147, "They": 1148, "detects": 1149, "Addison-": 1150, "ties": 1151, "Subsystem": 1152, "command,": 1153, "\u201cOWL": 1154, "regulators": 1155, "MakeVirtualOrder": 1156, "(Chen,": 1157, "592": 1158, "Guide.\u201d": 1159, "56\u201358": 1160, "photodesc": 1161, "are,": 1162, "temperature.": 1163, "Mostashari": 1164, "detect,": 1165, "I/O": 1166, "Mitigations": 1167, "Agile;": 1168, "occurring": 1169, "mix-": 1170, "rationale": 1171, "34\u201344.": 1172, "character),": 1173, "programs,": 1174, "Future": 1175, "than,": 1176, "Software/SRS/3.3.2": 1177, "(requirements": 1178, "A:": 1179, "unambiguous": 1180, "Subversion": 1181, "history": 1182, "component:": 1183, "Ivar": 1184, "discretion": 1185, "Meynadier,": 1186, "grammar": 1187, "Bosch,": 1188, "oped,": 1189, "fac-": 1190, "2002).": 1191, "16.": 1192, "B": 1193, "cyberat-": 1194, "Swartz,": 1195, "know:": 1196, "https://securosis.com/blog/agile-development-": 1197, "fat-client": 1198, "signal": 1199, "Dependability": 1200, "operator\u2019s": 1201, "offices.": 1202, "Kopetz,": 1203, "Resource": 1204, "112,": 1205, "10.3.": 1206, "facilities,": 1207, "24.5.1": 1208, "2005)": 1209, "broker": 1210, "heading": 1211, "(wrong)": 1212, "flow.": 1213, "elicit": 1214, "sprint,": 1215, "388,": 1216, "24.9": 1217, "carrying": 1218, "17.11.": 1219, "extends": 1220, "Fundamental": 1221, "Significant": 1222, "20.8.": 1223, "directory.": 1224, "7.10.": 1225, "survived.": 1226, "2.5": 1227, "module": 1228, "model)": 1229, "protection,": 1230, "income": 1231, "New": 1232, "thinking": 1233, "Different": 1234, "16ms": 1235, "1960s.": 1236, "Critical": 1237, "nature": 1238, "2010)": 1239, "Them.": 1240, "QSM.": 1241, "127": 1242, "braking.": 1243, "(data": 1244, "propertyType": 1245, "Easy": 1246, "descriptions:": 1247, "zero": 1248, "7.13:": 1249, "subsystem,": 1250, "9.7": 1251, "elicitation:": 1252, "opening": 1253, "Approved.\u201d": 1254, "plify": 1255, "283": 1256, "goes": 1257, "cloned": 1258, "(Hollnagel": 1259, "improvements": 1260, "prefers": 1261, "691,": 1262, "deployment,": 1263, "consultationFigure": 1264, "button": 1265, "Harnessing": 1266, "inti-": 1267, "Bishop": 1268, "cohesiveness": 1269, "alone.": 1270, "virtual,": 1271, "\u201cCan": 1272, "America.": 1273, "More": 1274, "(fault": 1275, "611": 1276, "health.": 1277, "14.6.": 1278, "6.12": 1279, "ethical": 1280, "\u201csystem,\u201d": 1281, "operations.": 1282, "Flight": 1283, "programmatically": 1284, ".com/caiinternet/ezine/capersjones-maintenance.pdf.": 1285, "simply": 1286, "(design,": 1287, "Multiple": 1288, "task-oriented": 1289, "coali-": 1290, "21.1.": 1291, "handbook.": 1292, "deficiencies": 1293, "houses,": 1294, "uncomfortable": 1295, "Processor": 1296, "concealed": 1297, "inconsistencies": 1298, "goods.": 1299, "compile": 1300, "Interfacing": 1301, "intention": 1302, "radiation": 1303, "converters,": 1304, "far": 1305, "assumption": 1306, "(0.5": 1307, "http://software-engineering-book.com/videos/implementation-and-evolution/": 1308, "actuator": 1309, "http://software-engineering-book.com/web/overhead-costs/": 1310, "(SOAP)": 1311, "bureaucracy": 1312, "preparation": 1313, "heard": 1314, "supposed": 1315, "195": 1316, "tricks.": 1317, "modated": 1318, "23.1).": 1319, "practice.\u201d": 1320, "configurability": 1321, "16.10": 1322, "Mistakes": 1323, "was.": 1324, "rationale,": 1325, "underway.": 1326, "bought": 1327, "Typeset": 1328, "Sommerville": 1329, "economies": 1330, "button,": 1331, "statusReport": 1332, "735,": 1333, "(1),": 1334, "(Kotonya": 1335, "Identify": 1336, "Reverse": 1337, "jobs": 1338, "client\u2013server,": 1339, "Whether": 1340, "Wagner": 1341, "219\u201321": 1342, "caught": 1343, "implementations.": 1344, "won\u2019t": 1345, "Dyb\u00e5,": 1346, "Services": 1347, "happened": 1348, "Baxter,": 1349, "co-located": 1350, "pollution": 1351, "Except": 1352, "course.": 1353, "associations": 1354, "61\u201365.": 1355, "481": 1356, "(Swartz": 1357, "responsibility": 1358, "Booch.": 1359, "architects": 1360, "263\u201364,": 1361, "Monitor": 1362, "2002.": 1363, "implemented?": 1364, "person-years),": 1365, "computerized": 1366, "N.,": 1367, "connection.": 1368, "8.9": 1369, "computers": 1370, "ule": 1371, "simulta-": 1372, "maximize": 1373, "incompatible": 1374, "process-oriented": 1375, "(Harford": 1376, "T4)": 1377, "measurable.": 1378, "Mars": 1379, "them?": 1380, "Code": 1381, "freezes": 1382, "browser,": 1383, "scribe.": 1384, "used.": 1385, "profession": 1386, "82.": 1387, "archive/nasa/casi.": 1388, "Decision.\u201d": 1389, "policy": 1390, "URI.": 1391, "Wheeler,": 1392, "fault-tolerant.": 1393, "Computationally": 1394, "resenting": 1395, "(SoS).": 1396, "cost-effective.": 1397, "ence": 1398, "12.9.": 1399, "because,": 1400, "P2P": 1401, "Experience": 1402, "correction": 1403, "63,": 1404, "get": 1405, "articles/2009/2009-june/how-scrum-helped-our": 1406, "long-term": 1407, "breached,": 1408, "VectorProcService": 1409, "(Tavani": 1410, "withdraw": 1411, "difficult": 1412, "measure": 1413, "validation": 1414, "Customized": 1415, "c8,": 1416, "consoles.": 1417, "improved.": 1418, "ini-": 1419, "(RPCs)": 1420, "Again,": 1421, "diverse.": 1422, "interaction": 1423, "667\u201399": 1424, "Python.": 1425, "Fahrenheit.": 1426, "Buying": 1427, "midnight": 1428, "24.": 1429, "1963)": 1430, "109\u201310": 1431, "prod-": 1432, "White.": 1433, "preserving": 1434, "cheaply": 1435, "contiguous": 1436, "revision": 1437, "Springer.": 1438, "inspections.": 1439, "(ii)": 1440, "view": 1441, "suited": 1442, "Fairley,": 1443, "317\u201318": 1444, "experimentation.": 1445, "public.": 1446, "Moodle,": 1447, "signed.": 1448, "Progress": 1449, "\ufeffChapter": 1450, "visi-": 1451, "clients.": 1452, "(Woodcock": 1453, "thank": 1454, "mapping,": 1455, "Allen,": 1456, "doi:10.1109/TDSC.2004.2.": 1457, "procedures.": 1458, "PUT": 1459, "(verification),": 1460, "Soc.": 1461, "Wordpress": 1462, "setback": 1463, "addItem": 1464, "543,": 1465, "inefficient.": 1466, "tice": 1467, "such": 1468, "(1).": 1469, "status.": 1470, "proto-": 1471, "Summaries": 1472, "market": 1473, "Management.": 1474, "Sometimes,": 1475, "Weiner": 1476, "industrial": 1477, "motivation": 1478, "symp-": 1479, "propos-": 1480, "receives.": 1481, "18\u201327.": 1482, "agent": 1483, "6.2.": 1484, "texts.": 1485, "in-out": 1486, "should": 1487, "361\u201367,": 1488, "asset.": 1489, "volunteers": 1490, "Table": 1491, "McGraw-Hill.": 1492, "\u201cpdrec\u201d": 1493, "8": 1494, "generators": 1495, "978-1-292-09613-1": 1496, "P1.0": 1497, "\u0007ethical\u0007for\u0007companies\u0007to\u0007release\u0007software\u0007that\u0007they\u0007know\u0007includes\u0007faults\u0007that\u0007could\u0007lead\u0007": 1498, "Currency": 1499, "9.3.": 1500, "peer-to-peer": 1501, "Publishing": 1502, "(days)": 1503, "deeper": 1504, "(MDA)": 1505, "490": 1506, "314": 1507, "straight-": 1508, "Brant,": 1509, "Veras": 1510, "spurious": 1511, "processes?": 1512, "retain": 1513, "subscription.": 1514, "fixes": 1515, "157": 1516, "17\u201326.": 1517, "SoS?": 1518, "unchanged": 1519, "transfers": 1520, "moderation.\u201d": 1521, "which": 1522, "(Deemer": 1523, "workgroup": 1524, "1.8).": 1525, "A1.1": 1526, "address": 1527, "component/system,": 1528, "collaboration": 1529, "track": 1530, "checks.": 1531, "\u2018OK\u2019": 1532, "hyphen)": 1533, "refer-": 1534, "0.0": 1535, "Paige,": 1536, "formally": 1537, "disables": 1538, "dollars)": 1539, "Zheng": 1540, "Reactor.": 1541, "Sprints": 1542, "Equipment": 1543, "Germany:": 1544, "planet.": 1545, "2009).": 1546, "hear,": 1547, "45,": 1548, "vulnerabili-": 1549, "six-point": 1550, "recon-": 1551, "ading": 1552, "clouds": 1553, "protection": 1554, "involv-": 1555, "measuring": 1556, "Its": 1557, "ducing": 1558, "September": 1559, "carried": 1560, "client\u2013server": 1561, "17.10)": 1562, "maintain.": 1563, "same:": 1564, "279,": 1565, "Success": 1566, "courses.": 1567, "rollback": 1568, "local,": 1569, "http://archive.cs.st-andrews.ac.uk/STSE-Handbook/": 1570, "720\u201321": 1571, "displayed.": 1572, "138": 1573, "in-car": 1574, "repository).": 1575, "collective": 1576, "will,": 1577, "Assistant:": 1578, "168,": 1579, "(3rd": 1580, "arithmetic,": 1581, "raised.": 1582, "calcu-": 1583, "dramatic": 1584, "customer-related": 1585, "748": 1586, "643\u201344": 1587, "download": 1588, "725,": 1589, "471\u201372,": 1590, "build-up": 1591, "\u2018collect": 1592, "techniques": 1593, "22.5).": 1594, "increased": 1595, "402": 1596, "658": 1597, "cuting": 1598, "traded": 1599, "developments": 1600, "17.1.1": 1601, "missed,": 1602, "Service-based": 1603, "de-register": 1604, "loads,": 1605, "119": 1606, "Datamatics": 1607, "adopted": 1608, "practised": 1609, "mentation": 1610, "critical": 1611, "707": 1612, "necessary,": 1613, "9.2.": 1614, "continuous,": 1615, "(M3/T2": 1616, "assumptions.": 1617, "C++,": 1618, "Nascimento,": 1619, "ago": 1620, "produc-": 1621, "36\u201338": 1622, "Comm.": 1623, "triggers,": 1624, "passes": 1625, "371": 1626, "just": 1627, "Unacceptable": 1628, "semantics.": 1629, "App": 1630, "securely.": 1631, "tolerance": 1632, "estimation.": 1633, "City": 1634, "able.": 1635, "Patterns": 1636, "ICASE": 1637, "used?": 1638, "ACM/": 1639, "from.)": 1640, "selection.": 1641, "Xie,": 1642, "avionics": 1643, "Languages": 1644, "\u201c1\u201d": 1645, "ready": 1646, "affected:": 1647, "230": 1648, "culture,": 1649, "Hirsch": 1650, "Mobile": 1651, "Bollella": 1652, "\u201cservices": 1653, "Multi-": 1654, "COLLEAGUES": 1655, "ValidationOperation": 1656, "preempts": 1657, "31.": 1658, "generic,": 1659, "\u201csci-": 1660, "(OilSoft)": 1661, "19,": 1662, "Load-balancing": 1663, "record": 1664, "partitions,": 1665, "section).": 1666, "18.3.2": 1667, "13/11/2009": 1668, "analyst\u2019s": 1669, "concluded": 1670, "dates": 1671, "dictionary.": 1672, "AND": 1673, "Defects": 1674, "RESTful).": 1675, "nificantly": 1676, "obsolete": 1677, "Predictor": 1678, "addition,": 1679, "Growth": 1680, "graphics": 1681, "89:11\u201317.": 1682, "hybrid": 1683, "marketed": 1684, "AyrshireFigure": 1685, "problem\u2014": 1686, "develop-": 1687, "ASSURE.2013.6614270": 1688, "later.": 1689, "rises": 1690, "52,": 1691, "doi:10.1109/": 1692, "forms\u201d": 1693, "(Torchiano": 1694, "whole": 1695, "\u201cundo\u201d": 1696, "service.": 1697, "circulate": 1698, "vertical": 1699, "availability,": 1700, "(Crabtree": 1701, "master": 1702, "combined": 1703, "browser": 1704, "356": 1705, "reviewers\u2019": 1706, "light),": 1707, "answer": 1708, "assume,": 1709, "Yonezawa,": 1710, "interleave": 1711, "law;": 1712, "service-requesting": 1713, "Briefly": 1714, "Fitzpatrick.": 1715, "kinds,": 1716, "doi:10.1109/MS.2007.75.": 1717, "quickly),": 1718, "human": 1719, "updating.\u201d": 1720, "advice.": 1721, "sense.": 1722, "Door.lock": 1723, "authorized": 1724, "E.": 1725, "before": 1726, "before.": 1727, "said": 1728, "generality.": 1729, "independent;": 1730, "15.14": 1731, "weatherReport": 1732, "DASIA": 1733, "Web-accessible": 1734, "pointer,": 1735, "sum": 1736, "apparent.": 1737, "collections": 1738, "collector": 1739, "excess": 1740, "doi:10.1145/230798.230809.": 1741, "297": 1742, "situations:": 1743, "300\u201301": 1744, "mapper": 1745, "Munich": 1746, "administer": 1747, "T13": 1748, "untrusted": 1749, "quently,": 1750, "munication": 1751, "everything.": 1752, "RE\u201993,": 1753, "//": 1754, "load,": 1755, "A1.1,": 1756, "machine?": 1757, "dispersed": 1758, "\u2021Coulouris,": 1759, "compartmentalization": 1760, "Warmer,": 1761, "279": 1762, "sentence,": 1763, "Socket": 1764, "organizes": 1765, "Alice\u2014self-oriented": 1766, "design-related": 1767, "dataset": 1768, "abstractions,": 1769, "engineer,": 1770, "UK": 1771, "argument": 1772, "Alternative": 1773, "tabulate": 1774, "chunk": 1775, "down,": 1776, "free;": 1777, "computer-": 1778, "Access)": 1779, "plan-driven.": 1780, "modify": 1781, "rare,": 1782, "identifiers,": 1783, "feasible,": 1784, "impractical": 1785, "machines),": 1786, "Stress": 1787, "phones.": 1788, "check-in)": 1789, "sis.": 1790, "Dispense": 1791, "Smashing": 1792, "Derivation": 1793, "(currentDose": 1794, "necessary.": 1795, "test,": 1796, "doi:10.1109/MS.2007.85.": 1797, "use-cases": 1798, "25,": 1799, "redundancy.": 1800, "execution.": 1801, "tions\u201d": 1802, "graph.": 1803, "(login)": 1804, "hazard,": 1805, "executed;": 1806, "tactical": 1807, "Taxonomy": 1808, "creep": 1809, "management;": 1810, "probabilities.": 1811, "order.": 1812, "ensuring": 1813, "effort": 1814, "143,": 1815, "(VC)": 1816, "Hong": 1817, "iterations": 1818, "Bugs": 1819, "book": 1820, "nominate": 1821, "collated": 1822, "fault-finding": 1823, "vision.": 1824, "concurrently": 1825, "653,": 1826, "(life-cycle": 1827, "created,": 1828, "phrase": 1829, "leave,": 1830, "am": 1831, "ysis": 1832, "203,": 1833, "analyzing": 1834, "Estimation.\u201d": 1835, "(M6)": 1836, "3.9": 1837, "207\u201308": 1838, "working,": 1839, "22.2.1": 1840, "operat-": 1841, "unconsciousness": 1842, "output,": 1843, "adapt-": 1844, "Com-": 1845, "Crucial": 1846, "Specialized": 1847, "integrity.": 1848, "licly": 1849, "Authentication,": 1850, "Which": 1851, "inaccurate,": 1852, "774": 1853, "contradict": 1854, "XYZ": 1855, "upgrade": 1856, "Portland,": 1857, "clock,": 1858, "understanda-": 1859, "theories": 1860, "interface)": 1861, "Moore.": 1862, "(Web": 1863, "Alice": 1864, "off\u201d).": 1865, "Infrastructure": 1866, "lifetimes,": 1867, "communica-": 1868, "(commands)": 1869, "ple\u2019s": 1870, "Nuseibeh.": 1871, "9.3.2": 1872, "225,": 1873, "(Bosch": 1874, "things,": 1875, "does.": 1876, "lies.": 1877, "family": 1878, "R": 1879, "way": 1880, "document;": 1881, "347": 1882, "RecordNotes": 1883, "7.4.": 1884, "undeclared": 1885, "4": 1886, "provided": 1887, "correctly": 1888, "intertwined.": 1889, "ist": 1890, "mistype": 1891, "Ordering": 1892, "Samsung": 1893, "455": 1894, "hiding,": 1895, "mally,": 1896, "pressures.": 1897, "knowl-": 1898, "indicate": 1899, "T14": 1900, "libraries": 1901, "Vogella": 1902, "subscription,": 1903, "Scrapping": 1904, "diagrams.": 1905, "stretch": 1906, "Designer,": 1907, "proposal.": 1908, "Theories": 1909, "6.11": 1910, "decomposing": 1911, "River,": 1912, "Collective": 1913, "DatabaseFigure": 1914, "Require-": 1915, "Editorial": 1916, "your": 1917, "QA": 1918, "5.16": 1919, "magazine": 1920, "documents,": 1921, "V.": 1922, "complexity,": 1923, "checklists": 1924, "15.2": 1925, "Gregory,": 1926, "non-intensive": 1927, "25.9": 1928, "degree": 1929, "don\u2019t,": 1930, "granted": 1931, "Kilner,": 1932, "timer": 1933, "compliance.": 1934, "food,": 1935, "(Sarris": 1936, "organizations": 1937, "443": 1938, "stopped": 1939, "Regression": 1940, "commands.": 1941, "infrastructure.": 1942, "past": 1943, "21.2.1.": 1944, "ponents.": 1945, "12.14.": 1946, "23.5,": 1947, "Ash,": 1948, "arrangement": 1949, "reuse.": 1950, "\u201cRational": 1951, "whole.": 1952, "Cook,": 1953, "events,": 1954, "Warning": 1955, "Puppet.": 1956, "Linda,": 1957, "effectively": 1958, "Leymann.": 1959, "possibility,": 1960, "landing,": 1961, "Will": 1962, "scaling": 1963, "Faults": 1964, "6.21": 1965, "ingenuity": 1966, "lines": 1967, "\u201creuse": 1968, "manufactured": 1969, "Khalaf,": 1970, "character.": 1971, "kind.": 1972, "Produced": 1973, "Errors.": 1974, "meets": 1975, "Principles,": 1976, "(6).": 1977, "omitted": 1978, "Mili": 1979, "CAD": 1980, "demonstrat-": 1981, "second-": 1982, "competences": 1983, "(serv-": 1984, "based\u201d": 1985, "mul-": 1986, "unimaginably": 1987, "uncertified": 1988, "packets": 1989, "test-case,": 1990, "discourages": 1991, "28,": 1992, "Assertion": 1993, "20.8": 1994, "depth.\u201d": 1995, "Representation": 1996, "years,": 1997, "Catastrophic": 1998, "1.1.": 1999, "6.3.": 2000, "status\u0007of\u0007switching\u0007and\u0007transmission": 2001, "Horton": 2002, "encyclopedia\u2014are": 2003, "S2": 2004, "22.7": 2005, "com/business/2012/04/exclusive-a-behind-the-scenes-look-at-facebook-release-engineering/": 2006, "(Badeau": 2007, "Increasing": 2008, "intelligence": 2009, "208\u201309": 2010, "component": 2011, "Rajamani,": 2012, "governing": 2013, "videoconferences": 2014, "experiments": 2015, "underperformance": 2016, "Transmitting": 2017, "Hofmeister,": 2018, "appear": 2019, "comparison": 2020, "22.8.": 2021, "conditions,": 2022, "used).": 2023, "1980;": 2024, "improve-": 2025, "objectively,": 2026, "sory": 2027, "risks": 2028, "Run": 2029, "cards": 2030, "1997),": 2031, "injury,": 2032, "Basics.\u201d": 2033, "403,": 2034, "clause.": 2035, "involve": 2036, "Kitchenham,": 2037, "regions.": 2038, "Size:": 2039, "operated,": 2040, "tificates": 2041, "16.15,": 2042, "Prototyping": 2043, "geared": 2044, "Heslin.": 2045, "large,": 2046, "Implementation": 2047, "acceptable.": 2048, "Mellor,": 2049, "hypothetical": 2050, "ellipse,": 2051, "visualization": 2052, "Serious": 2053, "(Conference": 2054, "Consultant": 2055, "vent": 2056, "dependable,": 2057, "nondeterminism": 2058, "Together.": 2059, "reveals": 2060, "22.5": 2061, "Frankfurt": 2062, "Chelsea": 2063, "does,": 2064, "authentica-": 2065, "ously": 2066, "owned": 2067, "Hnich,": 2068, "(BSD)": 2069, "signature": 2070, "accessi-": 2071, "18,": 2072, "161,": 2073, "probability": 2074, "Pooley.": 2075, "varies": 2076, "elicited.": 2077, "\u2020Fayad,": 2078, "Constraints": 2079, "I\u2019ve": 2080, "reorganization": 2081, "non-": 2082, "robust": 2083, "\u201cDocuments": 2084, "distracting": 2085, "(PIM)": 2086, "denial-": 2087, "overprovisioned;": 2088, "Shaw": 2089, "26th": 2090, "predictability.": 2091, "Arrows": 2092, "say)": 2093, "failure:": 2094, "examine": 2095, "trust.": 2096, "Publications.": 2097, "agility,": 2098, "exception-handling": 2099, "URT": 2100, "projects.": 2101, "Cliff,": 2102, "connections": 2103, "Vlissides.": 2104, "mismatches": 2105, "39\u201371.": 2106, "47\u201348": 2107, "these:": 2108, "ground": 2109, "Other": 2110, "ambiguous.": 2111, "proximity": 2112, "obliga-": 2113, "\u201ctasks.\u201d": 2114, "[sendInfo]": 2115, "Verifying": 2116, "120\u201329,": 2117, "184,": 2118, "converts": 2119, "(M1)": 2120, "topic": 2121, "restoring": 2122, "Knowledge)": 2123, "Components": 2124, "9.11": 2125, "Test-Driven": 2126, "Windows": 2127, "Restful": 2128, "treatments.": 2129, "removing": 2130, "contacted": 2131, "ahead": 2132, "nents": 2133, "cities,": 2134, "checking,": 2135, "involved": 2136, "correctly?": 2137, "telecommunications": 2138, "Consultation": 2139, "implicit": 2140, "Learning.": 2141, "obliged": 2142, "agile-methods-work-for-software-maintenance-part-1/": 2143, "scalable.": 2144, "assumes": 2145, "awareness": 2146, "spreadsheet,": 2147, "Release": 2148, "1994)": 2149, "747\u201350": 2150, "dynamics,": 2151, "threads,": 2152, "intervention,": 2153, "goals.": 2154, "Nord,": 2155, "software-oriented,": 2156, "J,,": 2157, "(1": 2158, "neer": 2159, "Undeclared": 2160, "radically": 2161, "WS-BPEL,": 2162, "tifies": 2163, "interface": 2164, "lifetime,": 2165, "673\u201375": 2166, "413\u201314": 2167, "Booch": 2168, "connectivity.": 2169, "Can.\u201d": 2170, "inquiry": 2171, "Adapting": 2172, "derived": 2173, "CM20": 2174, "399,": 2175, "simulated": 2176, "design\u2014how": 2177, "PlaceAndDate\u201d": 2178, "296,": 2179, "six-": 2180, "subscription": 2181, "priorities.": 2182, "circumvented": 2183, "century": 2184, "important.": 2185, "Function-point": 2186, "coverage.": 2187, "shape": 2188, "organizations.": 2189, "faulty.": 2190, "WWW": 2191, "cheese,\u2019": 2192, "artifact": 2193, "Pautasso,": 2194, "repositories.": 2195, "benefits": 2196, "5.2.": 2197, "12.3.1": 2198, "linked": 2199, "Introduction,": 2200, "principles": 2201, "Jabber,": 2202, "cessing": 2203, "understandability,": 2204, "Setup": 2205, "higher-priority": 2206, "130,": 2207, "service-oriented": 2208, "49,": 2209, "(RAD)": 2210, "596,": 2211, "symbol,": 2212, "Andrews": 2213, "Digital": 2214, "786": 2215, "(Y.": 2216, "Sommerlad.": 2217, "processes\u2014not": 2218, "</starter>": 2219, "Conversation": 2220, "345\u201346": 2221, "17.3.2": 2222, "competence.": 2223, "Code.\u201d": 2224, "languages,": 2225, "http://www.software-engineering-book.com/web/viewpoints/": 2226, "concentration": 2227, "202,": 2228, "organized,": 2229, "wish": 2230, "source),": 2231, "selects": 2232, "ideal": 2233, "recovery:": 2234, "Summary": 2235, "following": 2236, "invoca-": 2237, "(Reason,": 2238, "teachers,": 2239, "month,": 2240, "app": 2241, "feasible": 2242, "enterprises": 2243, "709\u201310,": 2244, "Pre-": 2245, "device": 2246, "fractions": 2247, "805": 2248, "Schmidt.": 2249, "voOut": 2250, "62\u201363": 2251, "usual": 2252, "battery": 2253, "respond": 2254, "scenarios.": 2255, "China.": 2256, "dependable\u201d": 2257, "MC.2010.22.": 2258, "consequences.": 2259, "unwise": 2260, "\u2020Maier,": 2261, "arranges": 2262, "342,": 2263, "selves": 2264, "software\u2014it": 2265, "neering,": 2266, "Recovery": 2267, "Inspections": 2268, "appointments.": 2269, "Off-the-Shelf": 2270, "2-D": 2271, "12.7.": 2272, "actions.": 2273, "Cunningham.": 2274, "platform.": 2275, "ready.\u201d": 2276, "McGarvey,": 2277, "organ-": 2278, "display,": 2279, "12.3?": 2280, "attacks": 2281, "233": 2282, "Efficiency": 2283, "motivate": 2284, "countries,": 2285, "8.3.1": 2286, "simplified": 2287, "five-digit": 2288, "skills,": 2289, "Basili,": 2290, "Andrey": 2291, "specified": 2292, "APIs": 2293, "booked": 2294, "50\u201357.": 2295, "newspa-": 2296, "face-to-face": 2297, "dependable.": 2298, "8.6.": 2299, "technical": 2300, "2013),": 2301, "rent": 2302, "537,": 2303, "traceability,": 2304, "RUSE": 2305, "common": 2306, "updated.": 2307, "complex": 2308, "job.": 2309, "postde-": 2310, "doi:10.1109/ICSE.2009.5070512.": 2311, "prepared.": 2312, "707\u201308": 2313, "Introduction": 2314, "(Lientz": 2315, "613": 2316, "exposed.": 2317, "allowed": 2318, "culminates": 2319, "observer.": 2320, "459": 2321, "533\u201341": 2322, "Dispatcher": 2323, "eading": 2324, "presenting": 2325, "crea-": 2326, "514\u201315": 2327, "domain,": 2328, "(Hull": 2329, "components),": 2330, "(\u00a9": 2331, "poorer": 2332, "incorporate": 2333, "represent": 2334, "Musa,": 2335, "templates": 2336, "433": 2337, "9001:": 2338, "Visit": 2339, "..*": 2340, "\u201cweatherInfo\u201d": 2341, "single-": 2342, "prise": 2343, "Analytics:": 2344, "\u00a310": 2345, "617\u201318": 2346, "(participate": 2347, "Apollo": 2348, "1988).": 2349, "retrospective": 2350, "Vol-": 2351, "sequences.": 2352, "fol-": 2353, "Practices,": 2354, "specification": 2355, "denials": 2356, "indi-": 2357, "Andrea,": 2358, "allocation,": 2359, "interactions": 2360, "throughput,": 2361, "11.2,": 2362, "cerned": 2363, "5.4.3": 2364, "requir-": 2365, "304,": 2366, "Tenant": 2367, "Internet-enabled.": 2368, "migrate": 2369, "split": 2370, "assist": 2371, "tolerate": 2372, "3.5.": 2373, "571,": 2374, "glance": 2375, "robot": 2376, "9.4": 2377, "(CM),": 2378, "sizes.": 2379, "12345": 2380, "risky,": 2381, "As": 2382, "completed": 2383, "shows": 2384, "(3),": 2385, "383": 2386, "Environment": 2387, "455,": 2388, "description": 2389, "shutdown()": 2390, "http://dx.doi.org/10.1145/570907.570928": 2391, "redocumenting": 2392, "associa-": 2393, "operating.": 2394, "3.7.": 2395, "Address,": 2396, "Production,": 2397, "28\u201334.": 2398, "doi:10.1093/comjnl/43.2.95.": 2399, "controls": 2400, "opposed": 2401, "743": 2402, "Studies": 2403, "Figure": 2404, "Then": 2405, "unification": 2406, "publicity": 2407, "justified,": 2408, "computer\u2019s": 2409, "Meyer": 2410, "conflict.": 2411, "demon-": 2412, "663": 2413, "(IBM": 2414, "4.3": 2415, "Precepts,": 2416, "coherent,": 2417, "ideas:": 2418, "schedule.": 2419, "7": 2420, "Complexity": 2421, "improvement.": 2422, "\u201ccorrectness\u201d": 2423, "shortage": 2424, "photograph.": 2425, "Robertson.": 2426, "village": 2427, "design:": 2428, "Author:": 2429, "Requested": 2430, "cache": 2431, "http://software-engineering-book.com/web/legacy-services": 2432, "find": 2433, "predictive": 2434, "controllers,": 2435, "partici-": 2436, "kph.": 2437, "Premature": 2438, "rapidity": 2439, "non-func-": 2440, "243\u2013314": 2441, "analyzer": 2442, "Door": 2443, "specifications": 2444, "(ATC)": 2445, "None.": 2446, "computer-aided": 2447, "search": 2448, "Amazon,": 2449, "577,": 2450, "postconditions.": 2451, "24.5": 2452, "arrived": 2453, "40\u201346.": 2454, "Ethical": 2455, "distribution": 2456, "\u201cNot-invented-here\u201d": 2457, "Store": 2458, "713\u201314.": 2459, "Economics": 2460, "formalized": 2461, "v.,": 2462, "systems).": 2463, "Collection": 2464, "documents.": 2465, "22.10": 2466, "mainline": 2467, "instrumented": 2468, "Iterative": 2469, "Unassigned": 2470, "106": 2471, "Common": 2472, "produced.": 2473, "tiers,": 2474, "acquired,": 2475, "Opdahl": 2476, "harm": 2477, "407,": 2478, "try": 2479, "488,": 2480, "light": 2481, "diagnostic": 2482, "Installation": 2483, "switch": 2484, "thoroughly": 2485, "measurements": 2486, "(DFDs)": 2487, "authority;": 2488, "(CRM)": 2489, "21.14": 2490, "cle": 2491, "unsuitable": 2492, "exist?": 2493, "dishonest": 2494, "4.3.1": 2495, "pipeline,": 2496, "198\u2013209,": 2497, "(W3C": 2498, "dures.": 2499, "Master": 2500, "asser-": 2501, "555": 2502, "second-class": 2503, "Transmission_time,": 2504, "stream.": 2505, "\u201cIterative": 2506, "affecting,": 2507, "mate": 2508, "19.1.2": 2509, "Lab": 2510, "Hospital": 2511, "ConfirmReservation": 2512, "basic": 2513, "40ms": 2514, "Event-B:": 2515, "access,": 2516, "These": 2517, "modified,": 2518, "24.11": 2519, "4.10": 2520, "Jacobson,": 2521, "Rayhan,": 2522, "models)": 2523, "government.": 2524, "2000,": 2525, "costs.": 2526, "cations.": 2527, "Bind": 2528, "offers": 2529, "We": 2530, "use;": 2531, "4.4.": 2532, "Indeed,": 2533, "win.\u201d": 2534, "Schmidt,": 2535, "Francisco,": 2536, "princi-": 2537, "appointed": 2538, "23rd": 2539, "plexity": 2540, "integrating": 2541, "service:": 2542, "Actions": 2543, "Test": 2544, "Prepare": 2545, "conduc-": 2546, "Executing": 2547, "annotate": 2548, "ingly": 2549, "(called": 2550, "Dutch": 2551, "(QM),": 2552, "0.002.": 2553, "ele-": 2554, "supplementary": 2555, "causes,": 2556, "tricably": 2557, "cohesion:": 2558, "57": 2559, "mainstream": 2560, "unaccredited": 2561, "poisoning": 2562, "case;": 2563, "linear": 2564, "2004,": 2565, "heavyweight,": 2566, "doi:10.1145/163359.163375.": 2567, "inventors": 2568, "correct?": 2569, "(user": 2570, "(ignoring": 2571, "programmers.": 2572, "code?": 2573, "749": 2574, "remind": 2575, "Larman": 2576, "Pattern": 2577, "allo-": 2578, "Operations:": 2579, "Cancel": 2580, "goal,": 2581, "input?": 2582, "Freeman,": 2583, "essential,": 2584, "726,": 2585, "Reuse": 2586, "Anchorage,": 2587, "re-input.": 2588, "implication": 2589, "etc.": 2590, "air-": 2591, "Restructured": 2592, "cohesiveness.": 2593, "Computer-Human": 2594, "image": 2595, "Kemerer.": 2596, "798": 2597, "short-term,": 2598, "OMG.": 2599, "inherent": 2600, "Meanings.": 2601, "Analytics": 2602, "trademarks,": 2603, "read,": 2604, "music": 2605, "accurate.": 2606, "corridors.": 2607, "Costs": 2608, "finding.": 2609, "measurement/metrics,": 2610, "64\u201373.": 2611, "volatile.": 2612, "hour),": 2613, "Chapter": 2614, "Reusability": 2615, "Simulating": 2616, "where,": 2617, "68": 2618, "machines": 2619, "Localize": 2620, "(Abrial": 2621, "shell.": 2622, "(iLearn)": 2623, "riding": 2624, "Allows": 2625, "months;": 2626, "Angeles,": 2627, "\u201cErrors": 2628, "re-designing": 2629, "falling": 2630, "Reference": 2631, "mitigation": 2632, "big": 2633, "practicality": 2634, "Blood": 2635, "email": 2636, "(Orfali,": 2637, "Algorithmic": 2638, "lowed": 2639, "Human": 2640, "seen,": 2641, "Update\u2014change": 2642, "overflows.": 2643, "21.10.": 2644, "S1": 2645, "management),": 2646, "trustworthy,": 2647, "Appendices": 2648, "Displays": 2649, "checks": 2650, "sage": 2651, "user,": 2652, "experienced": 2653, "Moving": 2654, "4.8": 2655, "Operations.\u201d": 2656, "257\u201358,": 2657, "leaksFigure": 2658, "Recognizing": 2659, "selector": 2660, "(Project": 2661, "reflective": 2662, "grammers": 2663, "18.7": 2664, "http),": 2665, "617\u201318,": 2666, "slides": 2667, "68,": 2668, "hostile": 2669, "drugs": 2670, "Date": 2671, "rectangles),": 2672, "post": 2673, "periodically": 2674, "concurrently.": 2675, "tem),": 2676, "Modifying": 2677, "system\u2019s": 2678, "limit": 2679, "6.3).": 2680, "quality": 2681, "theories,": 2682, "monolithic,": 2683, "2.2.3": 2684, "done.": 2685, "classified": 2686, "composition": 2687, "intentions": 2688, "HIllside": 2689, "corruption?": 2690, "transient": 2691, "PREX": 2692, "999": 2693, "136": 2694, "Technical": 2695, "fault-detection,": 2696, "insider)": 2697, "metrics,": 2698, "straightforward:": 2699, "Beta": 2700, "(Chrissis,": 2701, "Musings": 2702, "depends.": 2703, "planning": 2704, "lack": 2705, "300": 2706, "466": 2707, "renegotiating": 2708, "entity.": 2709, "Plan-Driven": 2710, "sold.": 2711, "accident:": 2712, "repre-": 2713, "Jenney,": 2714, "inquiry.": 2715, "18.5": 2716, "schedul-": 2717, "Quantitatively": 2718, "34%.": 2719, "do": 2720, "specification)": 2721, "4ms": 2722, "SU)": 2723, "deadlines": 2724, "efficienty": 2725, "258\u201361": 2726, "thermometer,": 2727, "Part": 2728, "expected": 2729, "465": 2730, "deploying,": 2731, "outer": 2732, "point": 2733, "included:": 2734, "420\u201321": 2735, "incur": 2736, "713,": 2737, "242,": 2738, "end-users": 2739, "clear-cut,": 2740, "functional-": 2741, "561": 2742, "help": 2743, "engineers.": 2744, "anticipated,": 2745, "permissions?": 2746, "lead": 2747, "1..4)": 2748, "\u201cclaim": 2749, "classes:": 2750, "sets.": 2751, "tablet": 2752, "reuse-oriented": 2753, "\u201caway": 2754, "protocols": 2755, "lost.": 2756, "opportunistic": 2757, "vice": 2758, "largest": 2759, "Combinations": 2760, "end-": 2761, "States,": 2762, "wants": 2763, "(case)": 2764, "distributed.": 2765, "drawn.": 2766, 